In [15]:
import pandas as pd
import numpy as np
from faker import Faker

In [16]:
fake = Faker()
random_data = [(fake.name(), fake.random_element(['Male', 'Female'])) for _ in range(5000)]

In [17]:
df = pd.DataFrame(random_data, columns=['Name', 'Gender'])

In [18]:
df.insert(0, column = 'Student ID', value = (np.arange(1,5001,1)))

In [19]:
courses = ['Data Science', 'Data Engineer', 'Data Analyst']
df.insert(2,column = 'Course', value = np.random.choice(courses, size=len(df)))

In [20]:
df['Course'].unique()

array(['Data Analyst', 'Data Engineer', 'Data Science'], dtype=object)

In [21]:
df['Age'] = np.random.randint(20,40,5000)

In [22]:
df['Duration']=''
for i, course in enumerate(df['Course']):
    if course == 'Data Science':
        df.loc[i, 'Duration'] = '12 Months'
    elif course == 'Data Engineer':
        df.loc[i, 'Duration'] = '9 Months'
    elif course == 'Data Analyst':
        df.loc[i, 'Duration'] = '3 Months'

In [23]:
df['Fees'] = ''
for i, course in enumerate(df['Course']):
    if course == 'Data Science':
        df.loc[i, 'Fees'] = 'Rs 40000'
    elif course == 'Data Engineer':
        df.loc[i, 'Fees'] = 'Rs 35000'
    elif course == 'Data Analyst':
        df.loc[i, 'Fees'] = 'Rs 30000'

In [24]:
payment = ['EMI','Full Paid']

df.insert(6,column = 'Payment Mode', value = np.random.choice(payment, size=len(df)))

In [25]:
emi = [5000,10000,15000,20000,'Paid']

df['Amount Paid or Remaining'] = ''
for i, payment in enumerate(df['Payment Mode']):
    if payment == 'EMI':
        df.loc[i, 'Amount Paid or Remaining'] = np.random.choice(emi)
    else:
        df.loc[i, 'Amount Paid or Remaining'] = 'Paid'

In [26]:
df

,Student ID,Name,Course,Gender,Age,Duration,Payment Mode,Fees,Amount Paid or Remaining
0,1,Ashley Waters,Data Analyst,Female,27,3 Months,Full Paid,Rs 30000,Paid
1,2,Betty Hernandez,Data Analyst,Female,20,3 Months,EMI,Rs 30000,Paid
2,3,Connor Gonzalez,Data Engineer,Female,25,9 Months,EMI,Rs 35000,15000
3,4,Alison Moore,Data Engineer,Male,20,9 Months,EMI,Rs 35000,Paid
4,5,Daniel Carter,Data Engineer,Male,29,9 Months,EMI,Rs 35000,Paid
...,...,...,...,...,...,...,...,...,...
4995,4996,Amber Perez,Data Analyst,Female,28,3 Months,Full Paid,Rs 30000,Paid
4996,4997,Dylan Stuart,Data Science,Female,34,12 Months,Full Paid,Rs 40000,Paid
4997,4998,Carla Miller,Data Engineer,Female,22,9 Months,EMI,Rs 35000,Paid
4998,4999,Benjamin Atkins,Data Analyst,Female,38,3 Months,Full Paid,Rs 30000,Paid
4999,5000,Brent Davis,Data Engineer,Female,35,9 Months,EMI,Rs 35000,20000

In [27]:
df.to_csv('data/data.csv', index=False)